Revit 2024 API
ExternalResourceMatchOptions Properties
The ExternalResourceMatchOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ResourceType
 The desired resource type which external resources should match.
See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace